#### 📖 Terraform Plan ('src/common/prod') - failure
<details>
<summary>Terraform Plan</summary>

```hcl
data.azurerm_linux_function_app.app_messages_xl[0]: Still reading... [10s elapsed]
data.azurerm_linux_function_app.app_messages_xl[1]: Still reading... [10s elapsed]
data.azurerm_linux_function_app.services_app_backend_function_app: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.session_manager_03: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_selfcare_be: Still reading... [10s elapsed]
data.azurerm_linux_web_app.firmaconio_selfcare_web_app: Still reading... [10s elapsed]
data.azurerm_linux_function_app.function_assets_cdn: Still reading... [10s elapsed]
data.azurerm_linux_function_app.eucovidcert: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.session_manager_04: Still reading... [10s elapsed]
data.azurerm_linux_function_app.wallet_user: Still reading... [10s elapsed]
data.azurerm_linux_function_app.services_app_backend_function_app: Still reading... [20s elapsed]
data.azurerm_linux_function_app.wallet_user: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_licences_app_itn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_devportal_be: Still reading... [10s elapsed]
data.azurerm_linux_function_app.function_profile[1]: Still reading... [10s elapsed]
data.azurerm_linux_function_app.function_profile[0]: Still reading... [10s elapsed]
data.azurerm_subnet.itn_auth_fast_login_func_snet: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.fims_op_app: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_vehicles_app_itn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_continua: Still reading... [10s elapsed]
data.azurerm_linux_function_app.lollipop_function: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_licences_app_itn: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_devportal_be: Still reading... [20s elapsed]
data.azurerm_linux_function_app.io_fims_user: Still reading... [10s elapsed]
data.azurerm_linux_function_app.function_profile[1]: Still reading... [20s elapsed]
data.azurerm_linux_function_app.function_profile[0]: Still reading... [20s elapsed]
data.azurerm_subnet.itn_auth_fast_login_func_snet: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_vehicles_app_itn: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [20s elapsed]
data.azurerm_linux_function_app.lollipop_function: Still reading... [20s elapsed]
Error: Subnet (Subscription: "ec285037-c673-4f58-b594-d7c480da4e8b"
Resource Group Name: "io-p-itn-common-rg-01"
Virtual Network Name: "io-p-itn-common-vnet-01"
Subnet Name: "io-p-itn-citizen-auth-fast-login-snet-01") was not found

  with data.azurerm_subnet.itn_auth_fast_login_func_snet,
  on data.tf line 101, in data "azurerm_subnet" "itn_auth_fast_login_func_snet":
 101: data "azurerm_subnet" "itn_auth_fast_login_func_snet" {


Error: listing Keys for Storage Account (Subscription: "ec285037-c673-4f58-b594-d7c480da4e8b"
Resource Group Name: "io-p-weu-messages-notifications-rg"
Storage Account Name: "iopweumessagesnotifst"): Post "https://management.azure.com/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-weu-messages-notifications-rg/providers/Microsoft.Storage/storageAccounts/iopweumessagesnotifst/listKeys?%24expand=kerb&api-version=2023-01-01": HTTP response was nil; connection may have been reset

  with module.app_backend_weu["1"].data.azurerm_storage_account.push_notifications_storage,
  on ../_modules/app_backend/data.tf line 21, in data "azurerm_storage_account" "push_notifications_storage":
  21: data "azurerm_storage_account" "push_notifications_storage" {

[id=https://io-p-kv-common.vault.azure.net/secrets/appbackend-TEST-CGN-FISCAL-CODES/640ad8cf343745c988b5ec3aa6b9edbd]
data.azurerm_linux_function_app.io_sign_user: Still reading... [10s elapsed]
data.azurerm_linux_function_app.io_fims_user: Still reading... [20s elapsed]
data.azurerm_subnet.itn_auth_fast_login_func_snet: Still reading... [30s elapsed]
module.app_backend_weu["1"].data.azurerm_storage_account.push_notifications_storage: Still reading... [10s elapsed]
data.azurerm_subnet.itn_auth_fast_login_func_snet: Still reading... [40s elapsed]
module.app_backend_weu["1"].data.azurerm_storage_account.push_notifications_storage: Still reading... [20s elapsed]
data.azurerm_subnet.itn_auth_fast_login_func_snet: Still reading... [50s elapsed]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.apim_itn.module.apim_v2.azurerm_api_management_logger.this[0] has been deleted
  - resource "azurerm_api_management_logger" "this" {
      - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/loggers/io-p-itn-apim-01-logger" -> null
        name                = "io-p-itn-apim-01-logger"
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # module.application_gateway_weu.azurerm_web_application_firewall_policy.api_app will be updated in-place
  ~ resource "azurerm_web_application_firewall_policy" "api_app" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/io-p-waf-appgateway-api-app-policy"
        name                = "io-p-waf-appgateway-api-app-policy"
        tags                = {
            "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"   = "Terraform"
            "Environment" = "Prod"
            "Owner"       = "IO"
            "Source"      = "https://github.com/pagopa/io-infra"
        }
        # (4 unchanged attributes hidden)

      ~ policy_settings {
          ~ request_body_inspect_limit_in_kb          = 0 -> 128
            # (6 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.apim_itn.module.apim_v2.azurerm_api_management_diagnostic.this[0] will be updated in-place
  ~ resource "azurerm_api_management_diagnostic" "this" {
      ~ api_management_logger_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/loggers/io-p-apim-v2-api-logger" -> (known after apply)
        id                        = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/diagnostics/applicationinsights"
        # (9 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.apim_itn.module.apim_v2.azurerm_api_management_logger.this[0] will be created
  + resource "azurerm_api_management_logger" "this" {
      + api_management_name = "io-p-itn-apim-01"
      + buffered            = true
      + id                  = (known after apply)
      + name                = "io-p-itn-apim-01-logger"
      + resource_group_name = "io-p-itn-common-rg-01"

      + application_insights {
          + instrumentation_key = (sensitive value)
        }
    }

  # module.global.module.dns.azurerm_dns_caa_record.ipatente_io_pagopa_it will be created
  + resource "azurerm_dns_caa_record" "ipatente_io_pagopa_it" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "@"
      + resource_group_name = "io-p-rg-external"
      + tags                = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra"
        }
      + ttl                 = 3600
      + zone_name           = "ipatente.io.pagopa.it"

      + record {
          + flags = 0
          + tag   = "iodef"
          + value = "mailto:security+caa@pagopa.it"
        }
      + record {
          + flags = 0
          + tag   = "issue"
          + value = "letsencrypt.org"
        }
    }

  # module.global.module.dns.azurerm_dns_ns_record.ipatente_io_pagopa_it_ns will be created
  + resource "azurerm_dns_ns_record" "ipatente_io_pagopa_it_ns" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "ipatente"
      + records             = (known after apply)
      + resource_group_name = "io-p-rg-external"
      + tags                = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra"
        }
      + ttl                 = 3600
      + zone_name           = "io.pagopa.it"
    }

  # module.global.module.dns.azurerm_dns_zone.ipatente_io_pagopa_it will be created
  + resource "azurerm_dns_zone" "ipatente_io_pagopa_it" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "ipatente.io.pagopa.it"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "io-p-rg-external"
      + tags                      = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra"
        }

      + soa_record (known after apply)
    }

Plan: 4 to add, 2 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.application_gateway_weu.azurerm_web_application_firewall_policy.api_app,
  on ../_modules/application_gateway/firewall.tf line 60, in resource "azurerm_web_application_firewall_policy" "api_app":
  60:       rule_group_override {

`disabled_rules` will be removed in favour of the `rule` property in version
4.0 of the AzureRM Provider.

(and 53 more similar warnings elsewhere)
::error::Terraform exited with code 1.
```

</details>
